	IDENTIFICATION DIVISION.
	PROGRAM-ID. ESTRUCTURAS.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
		01 VARIABLE-COMPUESTA.
			02 TEXTO1 PIC X(6) VALUE "Hello".
			02 TEXTO2 PIC X(6) VALUE "World!".
			02 VARIABLE-COMPUESTA-2.
				03 TEXTO3 PIC X(6) VALUE "Buen".
				03 TEXTO4 PIC X(6) VALUE "día.".
	
	PROCEDURE DIVISION.
	MAIN.
		DISPLAY VARIABLE-COMPUESTA.
		DISPLAY VARIABLE-COMPUESTA-2.
		STOP RUN.

	END PROGRAM ESTRUCTURAS.
