		IDENTIFICATION DIVISION.
		PROGRAM-ID. TIEMPOS.

		DATA DIVISION.
		WORKING-STORAGE SECTION.
			01 COUNTER PIC 9 VALUE 0.

		PROCEDURE DIVISION.
		MAIN-DIVISION.
			PERFORM PRINT 5 TIMES.
			STOP RUN.

		PRINT.
			DISPLAY "Impresion repetitiva: " COUNTER.
			ADD 1 TO COUNTER.

		END PROGRAM TIEMPOS.
