		IDENTIFICATION DIVISION.
		PROGRAM-ID. RUTINAS_2.

		DATA DIVISION.
		WORKING-STORAGE SECTION.
			01 SI-O-NO PIC X.
			01 TIPO PIC X.
			01 NUM1 PIC 9(2).
			01 NUM2 PIC 9(2).
			01 RESULT PIC 9(3).

		PROCEDURE DIVISION.
		PREGUNTA.
			PERFORM CONTINUAR.

			IF SI-O-NO = "S" OR SI-O-NO = "s"
				PERFORM TIPO-OPERACION
				PERFORM CALCULAR
				PERFORM PREGUNTA.
			IF SI-O-NO = "N" OR SI-O-NO = "n"
				GO TO FINALIZAR
			ELSE
				DISPLAY "Opción inválida: " SI-O-NO
				PERFORM PREGUNTA
			END-IF.

		CALCULAR.
			IF TIPO = "+"
				ADD NUM1 TO NUM2 GIVING RESULT
			IF TIPO = "-"
				SUBTRACT NUM1 FROM NUM2 GIVING RESULT
			IF TIPO = "*"
				MULTIPLY NUM1 BY NUM2 GIVING RESULT
			IF TIPO = "/"
				DIVIDE NUM2 BY NUM1 GIVING RESULT
			END-IF.
			DISPLAY "El resultado es: " RESULT.

		TIPO-OPERACION.
			DISPLAY "Ingrese el primer numero: ".
			ACCEPT NUM1.
			DISPLAY "Ingrese el segundo numero: ".
			ACCEPT NUM2.
			DISPLAY "Ingrese el tipo de operacion: ".
			ACCEPT TIPO.

		CONTINUAR.
			DISPLAY "¿Desea continuar con el programa?".
			ACCEPT SI-O-NO.

		FINALIZAR.
			STOP RUN.
		
		END PROGRAM RUTINAS_2.
