	IDENTIFICATION DIVISION.
	PROGRAM-ID. PUNTIL.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
		01 CTR PIC 9(3) VALUE 0.

	PROCEDURE DIVISION.
	MAIN-PROCEDURE.
		PERFORM SUMAR 10 TIMES.

		DISPLAY "For:"
		PERFORM UNTIL CTR = 20
			PERFORM SUMAR
		END-PERFORM.

		DISPLAY "Incremento: "
		PERFORM VARYING CTR FROM 30 BY 1 UNTIL CTR >= 50
			PERFORM MOSTRAR
			DISPLAY "Mr Fresh."
		END-PERFORM.

		DISPLAY "Decremento: "
		*> Empezar CTR desde 630, ir sumando 5 (+ 1 de sumar)
		PERFORM VARYING CTR FROM 630 BY -5 UNTIL CTR = 610
			PERFORM MOSTRAR
			DISPLAY "Mr Butter"
		END-PERFORM.

		STOP RUN.

	SUMAR.
		ADD 1 TO CTR.
		DISPLAY "Iteracion N: " CTR.

	MOSTRAR.
		DISPLAY "Contador: " CTR.

	END PROGRAM PUNTIL.
