		IDENTIFICATION DIVISION.
			PROGRAM-ID. VAR_Y_CONST.
		
		DATA DIVISION.
			FILE SECTION.
			WORKING-STORAGE SECTION.
				01 SALUDO PIC X(4) VALUE "Hola".
				01 EDAD PIC 9(2) VALUE 20.

		PROCEDURE DIVISION.
			MAIN-PROCEDURE.
				DISPLAY "Función main.".
				DISPLAY SALUDO.
				DISPLAY "Tu edad es: " EDAD.
				STOP RUN.
		
		END PROGRAM VAR_Y_CONST.